from itertools import count
from turtle import colormode
import pandas as pd
import matplotlib.pyplot as plt

data = pd.read_csv('kisa.csv',encoding='euc-kr')

# print(data.head())
# print(data.sort_values(by='년도'))
print(data['종목명'].unique())
'''
['생산관리분야' '공정관리' '품질경영' '품질관리' '포장' '디자인분야' '서비스·경험디자인' '제품디자인' '시각디자인'
 '컬러리스트' '건축분야' '실내건축' '건축' '건축설비' '토목분야' '콘크리트' '토목' '항로표지' '측량및지형공간정보'
 '지적' '해양1급' '해양환경' '해양자원개발' '해양공학' '응용지질' '건설재료시험' '철도보선' '철도토목' '조경분야'
 '조경' '도시.교통분야' '도시계획' '교통' '채광분야' '화약류관리' '광산보안' '지하수' '광해방지분야' '광해방지'
 '기계제작분야' '일반기계' '계량1급(제11류)' '기계공정설계' '기계설계' '치공구설계' '정밀측정(기계분야)'
 '정밀측정(전기분야)' '정밀측정' '계량(전기분야)' '계량(기계분야)' '계량(물리분야)' '기계장비설비.설치분야' '농업기계'
 '윤활관리' '건설기계' '건설기계설비' '건설기계정비' '궤도장비정비' '메카트로닉스' '승강기' '공조냉동기계' '설비보전'
 '철도분야' '철도차량' '조선분야' '조선' '선박기계1급' '항공분야' '항공' '자동차분야' '그린전동자동차'
 '그린전동자동차기사' '자동차정비' '자동차검사' '금형.공작기계분야' '사출금형설계' '프레스금형설계' '금속.재료분야'
 '금속1급' '금속(재료분야)' '금속(제련분야)' '금속(가공분야)' '금속' '금속재료' '세라믹' '용접분야' '용접'
 '화공분야' '화공' '공업화학' '화약류제조' '화학분석' '바이오화학제품제조' '생물공학' '섬유분야' '섬유1급' '방직'
 '섬유기계' '염색가공' '방사' '섬유물리' '섬유화학' '섬유' '생사' '의류' '전기분야' '전기' '전기공사' '철도신호'
 '전기철도' '전자분야' '임베디드' '전자' '반도체설계' '의공' '로봇기구개발' '로봇소프트웨어개발' '로봇하드웨어개발'
 '전자계산기' '광학' '공업계측제어' '정보기술분야' '정보처리' '전자계산기조직응용' '빅데이터분석' '정보보안'
 '방송.무선분야' '방송통신' '무선설비' '유선설비1급' '통신분야' '전파통신' '전파전자' '정보통신' '전파전자통신'
 '식품분야' '식품' '수산제조' '식육가공' '인쇄.사진분야' '인쇄' '제판' '농업분야' '종자' '화훼장식' '유기농업'
 '농화학' '시설원예' '축산분야' '축산' '임업분야' '식물보호' '산림' '산림공학' '산림경영' '임업종묘' '임산가공'
 '어업분야' '해양생산관리' '수산양식(1류)' '수산양식(2류)' '수산양식(3류)' '수산양식(4류)' '수산양식' '어병'
 '어로' '어업생산관리' '안전관리분야' '산업안전' '건설안전' '화재감식평가' '농작업안전보건' '방재' '가스'
 '산업위생관리' '인간공학' '소방설비(기계분야)' '소방설비1급' '소방설비(전기분야)' '소방설비(화공)' '소방설비(토목)'
 '소방설비(건축)' '비파괴검사분야' '방사선비파괴검사' '초음파비파괴검사' '자기비파괴검사' '침투비파괴검사' '와전류비파괴검사'
 '비파괴검사1급(전자기침투)' '누설비파괴검사' '환경분야' '온실가스관리' '온실가스관리기사' '환경위해관리'
 '환경관리1급(소음진동)' '농림토양평가관리' '대기환경' '수질환경' '소음진동' '대기환경,수질환경,소음진동' '생물분류'
 '자연생태복원' '토양환경' '폐기물처리' '생물분류(식물)' '생물분류(동물)' '에너지.기상분야'
 '신재생에너지발전설비(태양광)' '원자력' '에너지관리' '열관리' '기상' '기상감정']
'''
print('---------각종 종목별 자격자 취득 현황----------')

x=['생산관리분야','에너지관리','열관리','기상']
y=[]

print(data[data['종목명']=='생산관리분야'])
data_sansan = data[data['종목명']=='생산관리분야']
print(data_sansan.iloc[0,-1])
y.append(data_sansan.iloc[0,-1])
data_sansan = data[data['종목명']=='에너지관리']
print(data_sansan.iloc[0,-1])
y.append(data_sansan.iloc[0,-1])
data_sansan = data[data['종목명']=='열관리']
print(data_sansan.iloc[0,-1])
y.append(data_sansan.iloc[0,-1])
data_sansan = data[data['종목명']=='기상']
print(data_sansan.iloc[0,-1])
y.append(data_sansan.iloc[0,-1])

import numpy as np
arr = np.random.standard_normal((8, 100))

plt.rc('font', family='Malgun Gothic')
plt.bar(x,y,color = ['pink','green','chocolate','lawngreen'])
plt.show()